# parameters
nc: 80  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple

# anchors
anchors:
  - [58,84, 132,183, 187,313]  # P5/32
  - [30,61, 62,45, 59,119]  # P4/16
  - [10,13, 16,30, 33,23]  # P3/8
  - [3,4, 4,9, 8,6]    #P2/4

# YOLOv5 backbone
backbone:
  # [from, number, module, args]                 #input 3*640*640
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2            #0    320
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4         #1    160
   [-1, 3, BottleneckCSP, [128]],                #2    160
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8         #3     80
   [-1, 9, BottleneckCSP, [256]],                #4     80
   [-1, 1, SELayer, [256, 16]],                  #5     80
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16        #6       40
   [-1, 9, BottleneckCSP, [512]],                #7       40
   [-1, 1, SELayer, [512, 16]],                  #8       40
   [-1, 1, Conv, [1024, 3, 2]], # 7-P5/32        #9         20
   [-1, 1, SPP, [1024, [5, 9, 13]]],             #10        20
   [-1, 1, SELayer, [1024, 16]], # ch,re         #11        20
  ]

# YOLOv5 head
head:
  [[-1, 3, BottleneckCSP, [1024, False]],  # 9           #12     20

   [-1, 1, Conv, [512, 1, 1]],                           #13     20
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],           #14     40
   [[-1, 8], 1, Concat, [1]],  # cat backbone P4         #15     40     6
   [-1, 3, BottleneckCSP, [512, False]],  # 13           #16     40

   [-1, 1, Conv, [512, 1, 1]],                           #17     40
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],           #18     80
   [[-1, 5], 1, Concat, [1]],  # cat backbone P3         #19     80     4
   [-1, 3, BottleneckCSP, [512, False]],                 #20     80

   [-1, 1, Conv, [256, 1, 1]],                           #21     80
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],           #22     160
   [[-1, 2], 1, Concat, [1]],  # cat backbone P2         #23     160    4
   [-1, 3, BottleneckCSP, [256, False]],                 #24     160
   [-1, 1, nn.Conv2d, [na * (nc + 5), 1, 1]],  # 18 (P2/4-small)        #25      160

   [-1, 1, Conv, [256, 3, 2]],                           #26     80
   [[-1, 21], 1, Concat, [1]],  # cat backbone P3        #27     80    4
   [-1, 3, BottleneckCSP, [256, False]],                 #28     80
   [-1, 1, nn.Conv2d, [na * (nc + 5), 1, 1]],  # 18 (P3/8-small)        #29      80

   [-2, 1, Conv, [256, 3, 2]],                                          #30      40
   [[-1, 17], 1, Concat, [1]],  # cat head P4                           #31      40    14
   [-1, 3, BottleneckCSP, [512, False]],                                #32      40
   [-1, 1, nn.Conv2d, [na * (nc + 5), 1, 1]],  # 22 (P4/16-medium)      #33      40

   [-2, 1, Conv, [512, 3, 2]],                                          #34      20
   [[-1, 13], 1, Concat, [1]],  # cat head P5                           #35      20     10
   [-1, 3, BottleneckCSP, [1024, False]],                               #36      20
   [-1, 1, nn.Conv2d, [na * (nc + 5), 1, 1]],  # 26 (P5/32-large)       #37      20

   [[], 1, Detect, [nc, anchors]],  # Detect(P5, P4, P3)
  ]